; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 688227 2 3 3 5 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph2 - mode
	infrared0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star0 - direction
	Star2 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(have_image Star5 thermograph1)
	(have_image Phenomenon6 thermograph1)
	(have_image Star7 thermograph1)
	(have_image Planet8 thermograph2)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 4
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 4
3. (turn_to satellite0 star7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star7)
   goals met: 0 of 4
4. (turn_to satellite1 groundstation3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 4
5. (calibrate satellite1 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 0 of 4
6. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 0 of 4
7. (turn_to satellite1 star7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star7)
   goals met: 0 of 4
8. (turn_to satellite0 groundstation3 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 4
9. (take_image satellite1 star7 instrument4 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 1 of 4
10. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 1 of 4
11. (turn_to satellite1 planet8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet8)
   goals met: 1 of 4
12. (turn_to satellite0 star5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star5)
   goals met: 1 of 4
13. (take_image satellite1 planet8 instrument4 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 2 of 4
14. (take_image satellite0 star5 instrument2 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 3 of 4
15. (turn_to satellite1 phenomenon6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 4
16. (turn_to satellite0 phenomenon6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 4
17. (take_image satellite0 phenomenon6 instrument2 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 4 of 4
